#version: 0.2
Ġ Ġ
ĠĠ ĠĠ
ĠĠĠĠ ĠĠĠĠ
ĠĠ Ġ
i n
e r
o n
r e
a t
s t
e n
Ġ t
o r
ĉ ĉ
l e
Ċ ĠĠĠĠ
s e
Ġ =
a n
Ċ ĠĠĠĠĠĠĠĠ
a l
d e
Ġ c
a r
) ;
i on
Ċ ĠĠĠ
- -
i t
Ġ *
c t
h e
s s
m e
ĊĠĠĠĠ ĠĠĠ
* *
Ġ {
g e
r o
< /
Ġ (
i s
i c
Ġ f
u r
l a
= "
Ġ p
/ /
in g
i f
Ċ ĉĉ
en t
c e
u n
Ċ ĉ
u t
Ġ <
Ċ Ġ
i d
Ġ n
Ġ s
Ġ a
l o
Ġ 0
e d
Ġ re
Ġ b
Ġt he
- >
Ġ "
Ġ }
t r
c o
p e
m p
0 0
Ġ in
e x
a d
a me
u e
ĊĠĠĠĠĠĠĠĠ ĠĠĠ
-- --
at e
= =
Ġ o
l i
" >
u l
t h
c k
i g
i l
e l
Ġ m
( )
Ġ v
i v
la ss
st r
Ġ w
Ġ '
Ġ d
ur n
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠ
at ion
t urn
ĠĠĠĠ ĠĠĠ
c h
** **
ge t
s p
p t
o t
h t
o l
Ġ S
a ge
e t
ct ion
y pe
a b
in t
u b
Ġt h
on t
e s
a p
an d
u m
Ġ if
Ġ $
Ġc lass
ĊĠĠĠĠ Ġ
u s
Ġ 1
Ġ C
Ġ h
se t
Ġt o
ex t
I n
Ġ T
a s
de f
in e
or t
e w
a m
o de
" ,
R e
Ġ A
Ġ* /
ĊĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
at a
en d
. .
Ċ Ċ
i le
u p
Ġ //
t er
l ic
: :
e ct
i z
ĊĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠ
t o
e m
r a
---- ----
r i
ab le
o d
Ġre turn
Ġo f
' ,
I N
Ġ -
al ue
a v
Ġ &
== ==
v er
Ċĉĉ ĉĉ
Ġ st
Ġ P
a se
( "
f f
Ġ is
E R
Ġf or
o ur
q u
pt ion
Ġ @
Ċ ĊĠĠĠ
o w
ul t
/ *
Ġ +
a ck
c on
( );
o m
Ġ i
**** ****
re f
Ġth is
i st
al l
.. /
m ent
Ġ l
) )
Ġ e
o p
Ċĉĉ ĉ
t e
iz e
Ġ N
d er
er t
O N
Ġ L
i r
un ction
Ġ 2
our ce
f o
Ġc on
R E
d iv
č Ċ
_ _
m l
t d
Ġ </
Ġ se
Ġ D
Ġ F
Ġ M
s c
n ame
k e
j ect
ub lic
u ct
sp an
i m
> </
Ġ g
an s
er s
) ,
it h
Ġ .
or m
ĊĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
a c
p ar
re turn
o id
Ġ I
> <
# #
Ġ G
( '
Ġ and
Ġ [
ss age
ig ht
l f
i b
th is
str uct
Ġ de
er r
tr ing
E x
O R
l u
Ġ r
Ġ :
i me
n t
ht ml
S t
S T
o s
Ġ or
ar t
p ut
re s
E N
o c
Ġ= =
p ro
Ġb e
d d
Ġ B
ul l
ig n
Ġ= >
a in
a re
Ġt r
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠ
Ġh ref
i mp
u se
Ġn ew
lo ck
Ġin t
Ġ !
o ut
b ject
co de
e st
a g
Ġ |
t ype
Ġp ro
ĠĠĠĠ Ġ
../ ../
at ic
A T
in d
Ġ #
A R
ad d
lo c
a ct
me ssage
q ue
at h
t p
str ing
A L
o un
Ġ ex
Ġ it
T ype
ar g
Ġf unction
Ġ on
o o
l y
Ġ /
Ġ O
00 00
3 2
N ame
ro m
d ata
el se
ra y
de x
ic e
v ent
s ource
b u
I T
s er
a ce
-------- --------
Ċ ĊĠĠĠĠĠĠĠ
U L
co m
co l
S E
it y
def ine
) .
la y
u re
i al
i p
imp ort
Ġ W
i re
D E
Ġ >
f orm
f t
li st
c ont
ro w
Ġc h
p r
0 1
Ċ ĊĠ
Ġ E
m a
Ġ un
al se
Ċ ĠĠ
v e
==== ====
it e
f ig
s h
Ġp ublic
Ġn ame
l l
Ġ _
par am
ĊĠĠĠĠĠĠĠĠ Ġ
Ġ )
ke y
iv e
p x
P ro
) );
" );
a y
p er
tr ans
Ġv oid
o mp
on e
Ġ U
Ġt ype
S tring
L E
it ion
p ort
Ġn ot
Ġ an
de v
// //
en se
i el
an ce
le ment
ht tp
Ġ H
c lu
iel d
D e
in k
Ġv alue
Ġc ont
A N
o st
Ġw ith
Ġ get
Ġ y
******** ********
C on
ri pt
Ġ j
Ġcon st
b o
I D
re e
Ġse lf
( $
ar y
Ġ else
clu de
m o
I d
Ġ /*
Ġ def
ce ss
or y
p p
Ġv ar
or d
re ss
C ont
que st
v al
lo g
ib ut
i o
Ġ R
Ġ& &
Ġ V
en er
L ist
Ġ %
' ]
a ult
S S
b er
Ġw h
o re
at or
"> <
an ge
i ew
C T
s ize
p h
a k
: //
an t
l ation
Ġ al
a ss
Ġ set
g ro
it le
err or
on g
he ck
u le
us er
il d
en g
c lass
Ċĉĉĉĉ ĉĉ
Ġb y
T o
Ġd ata
ac he
E n
i x
lo w
f ile
Ġ! =
Ġn ull
re ad
Ġ me
at ch
r c
v alue
Ġ \
re ate
Ġ 3
an g
[ '
Ġf alse
o int
a il
v ar
čĊ č
Ġ Re
ap p
il l
at ed
trans lation
S e
n b
Ġth at
i es
y le
l ine
UL L
1 0
id th
Ġa s
ce ption
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
Ġ id
ar ray
Ġtr ue
Ġf ile
i de
le ct
1 2
m s
a x
1 6
M E
ĠĠĠĠ ĠĠ
a mp
d ate
r r
} ,
Ġ use
ad er
st atic
ic ense
V alue
v ice
um ent
in clude
r iv
ur re
M A
nb sp
th od
or k
ar d
] ,
Ġs h
Ġ );
la b
eng th
Ġ In
ĠT he
o g
T R
Ġd o
Ġ `
er y
ode l
I C
o u
C h
D ata
t ext
" ;
un d
C O
) :
as k
u st
b ack
p ert
g s
w w
Ġ 4
/ >
č ĊĠĠĠ
at us
U T
6 4
" :
## ##
] ;
v oid
un t
a st
ĠL icense
o f
č ĊĠĠĠĠĠĠĠ
g r
urre nt
pe c
" )
Ġf rom
b e
ption s
se lf
Ċ Ċĉ
Ġ} ,
P E
1 1
Ġl ine
m d
F F
Ġre s
S et
j s
C H
Ġ at
in fo
in al
s ign
r ight
Ċĉĉĉĉ ĉ
Ġ| |
en s
Ġ __
Ex ception
Ġ( !
n ew
' )
A r
Ġ x
av e
Ġ u
ar ch
li ent
en ce
rr or
or der
ĠN ULL
č Ċĉ
um ber
y st
L A
ow n
b r
R O
Ġc ol
e c
re ak
I ON
sp on
p re
+ +
Ġ/ **
G et
ar get
le t
C ol
"> </
r ame
is p
e b
Ġ ?
r y
M e
yst em
Ġ end
Ġ string
ff er
' );
I G
in dex
r ite
lo ad
A D
l ink
loc ation
Ġ --
oun d
a ch
" />
] .
t y
0 2
O bject
m in
Ġc om
op y
L O
n e
m it
t able
st ance
to p
g er
o b
co mp
() .
oun t
sc ript
Ġ 5
qu al
h is
Ġs o
con st
Ġp ar
ss ion
o ul
/ **
R es
Ġc ase
d i
o ol
tr ibut
od ule
ĊĠĠĠĠĠĠĠĠ ĠĠĠĠĠ
f or
P ar
() );
oul d
E rror
he d
y n
Ġch ar
Ġa re
it em
S er
re g
s o
ĠS tring
er e
K e
P I
re am
Ġst atic
( &
le ft
ers ion
Ġ k
av a
if i
an n
Ġa dd
p ublic
t on
e mp
f unction
or g
F ile
n av
Ġs ize
Ke y
. _
ut ton
Ġ< <
te st
Ġc omp
IN T
ss ert
t ime
B u
le an
m ap
th er
Ġ array
m b
Ġ he
() ,
G E
pe ct
l ate
//// ////
ur l
A B
spon se
il ter
as h
qu ire
sign ed
e e
' :
= '
co unt
Ġo ut
are nt
I S
A C
Ġi mp
' ;
ut h
riv ate
t em
Ġt est
ir st
pert y
sp ace
s ub
ind ow
======== ========
b ar
Ġ Q
} ;
Ġw e
2 5
00 0
Ġb u
3 3
Ġ li
f ace
S c
T est
T E
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠ
m ary
p ath
Ġ en
t ing
ame ter
od y
T r
g in
Ġ struct
Ġc an
er n
U R
c l
---------------- ----------------
un c
ĉĉ ĉĉ
m and
Ġor g
con fig
U N
de d
u d
os ition
U n
Ġres ult
2 0
c p
ĠT his
IN G
c cess
Ġp rivate
g le
E vent
C omp
N ode
In fo
w ork
n d
I tem
Ġ J
lab el
M P
Ġw ill
gro up
u al
s um
9 9
T ime
Ġs c
l ength
lo at
o ver
Ġ list
() )
isp lay
Ġ// /
b lock
col or
pr int
r ap
A t
f er
w are
e p
i str
Ċ ĊĠĠĠĠĠĠĠĠĠĠĠ
ic on
mo ve
T Y
1 5
if y
oc ument
p ack
en u
in put
! --
I L
ut il
Ġ error
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠ
gro und
c c
r it
a ction
ro up
st ate
č ĊĠĠĠĠĠĠĠĠĠĠĠ
ro ll
le te
l er
um n
T ext
n ode
d b
and le
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
St ate
Ġ up
ro l
fo re
se s
l en
Ġy ou
t a
p age
v el
B y
E D
T H
Ġ key
Ġ arg
Ġv al
ph p
ar k
[ ]
in it
m i
if ic
Ġ( (
EN T
=" ../../
C lass
on ent
Ġo bject
u i
la gs
st art
amp le
la st
U S
Ġ 8
A dd
E lement
le ction
ter n
. </
" "
ation s
Ġ all
v iew
t itle
ire ct
b t
b ase
1 4
E S
p en
s k
bu f
c ase
n o
**************** ****************
Ġt itle
In dex
o ff
M ap
f ield
end if
a ke
w idth
ut e
a le
A S
k en
oo lean
1 8
ect or
O T
p s
se d
qu ery
tr y
m age
sc ri
ub le
e vent
y s
d o
it s
me m
us h
* /
im age
in ed
Ġb ack
6 6
us ing
n ot
ag er
Ġf inal
Ġa ssert
C ON
ER R
re t
D I
res ult
V iew
st yle
Ġcont ent
w ord
http s
Ġ-- >
ain er
ch ar
Ġ+ =
qu ot
( (
i a
S h
ic k
la ce
Ġ str
ft ware
C E
bo x
i e
a f
0 4
ĊĠĠĠĠĠĠĠĠ ĠĠĠĠ
m on
1 3
ri de
Con fig
re d
T D
E X
def ault
l at
C om
Ġt ime
arg in
ma x
ent ry
ra w
s m
č Ċĉĉ
S ize
Ġb reak
b y
Ġs pec
Ġ K
l d
ist er
n um
t x
pr iv
Ġ ro
O P
Ġ err
c reate
val id
all back
lo b
oo k
el l
Ġs rc
es c
5 5
ww w
Ġun der
Q u
to m
c ur
up port
tribut e
F ield
able d
ass ert
Ar ray
F orm
P ath
n et
> &
S I
p y
cont ent
an ager
f in
; &
2 4
Ġa pp
Ġs er
bu g
f rom
ut o
o bject
n g
H e
n ext
n ing
and ler
T I
o ck
Cont ext
Me ssage
u int
ver ride
li b
ur ation
d t
ĠI f
Ġdef ault
Ġp er
O L
b ody
r int
co re
Re quest
te mp
p i
č ĊĠ
Ġth row
; </
AT E
con d
he ad
o x
Ġh ave
Ġ} );
E qual
Ġb ool
E L
le d
ĠG et
Ġ 6
m at
o me
M O
Ġsh ould
F I
yn c
A ME
f s
is hed
ĠA N
p os
Ġn o
c heck
D O
ic h
loc al
p tr
lay er
Ġ ext
ver s
C ode
p ress
sum mary
8 0
c ss
Ġt ext
w rite
p oint
Ġtr ans
at ure
Ġre g
` `
Ġv ersion
B U
cont ext
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
Ġ le
Ġn ode
Ġan y
f unc
T h
' s
add ing
Ġre quest
d ir
istr ibut
ib le
Ġn e
ting s
Ġ user
M L
Ġ= ==
ap i
I P
l t
TY PE
] )
ot tom
3 0
S C
Ġcol or
Ġs ub
N U
Ġb order
Ċ ĊĠĠĠĠĠ
Ġc ode
Ġe vent
s w
A n
Ġc urrent
ol d
t he
1 7
opy right
C K
Ġc heck
st atus
d is
a pt
l ang
m odule
#### ####
S P
lo se
' t
Ġ} ;
=" +
Ġ X
Ġst d
ann el
2 2
id er
n er
Ġ1 0
ect ed
Ġw idth
1 9
Ġme thod
Ġh as
U E
w eb
U p
en ame
se lect
Ġt arget
o k
q l
L e
ä ¸
A P
Ġ Y
t s
c ord
L og
in s
id get
t es
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
b utton
ic s
Ġ z
ce pt
m odel
P O
g t
la s
Ġj ava
Ġst art
++ )
ch o
Ġl ong
t il
re p
lu gin
ĊĠĠĠĠ ĠĠ
Ġre quire
ã ģ
Ġwh en
Ser vice
=" #
Res ult
il der
Ġ 7
ap ache
c urrent
T able
ne ction
Ġin ter
s rc
ĠĠĠĠĠĠĠĠ ĠĠĠ
In t
H E
Ġst yle
u x
2 01
Ġu int
Col or
w h
Ġcon fig
Ġ: =
C L
AB LE
ent er
U P
Ġ log
Ġn umber
O f
Ġuse d
it or
Ġ( $
o ptions
le ar
5 0
ĠS t
N ot
oo gle
i se
E T
b l
c lient
Ġ" \
Ð °
ĠC on
pack age
p c
Ġm ay
ion s
m od
Qu ery
f ont
add r
Ġback ground
d own
M odel
b reak
3 4
Ġf ield
Ġst ate
De f
=" ../
ĠG ener
="../../ ../../
O r
all y
Ġ2 01
ĠC ON
dev ice
Ġin dex
w e
tr ue
it ch
Ġit em
ĠS et
lic ense
2 8
Z E
he ader
ifi ed
C ount
v ed
en c
a it
un signed
ot o
L oc
O ut
ial iz
int er
t ot
T he
ic es
Ċĉ ĠĠĠ
Ġin put
Ġof f
Ġb lock
Ġre ad
bt n
AR T
Ġre t
ĠS ystem
I O
m t
V ER
arg s
ic al
Ġ OR
re n
F A
[ "
p l
at tr
ust om
Ġ Ð
se arch
off set
il ename
> (
uth or
OR T
gr am
ro p
Ġd istribut
U ser
scri ption
e f
I s
pect ed
it er
O UT
d oc
lob al
O n
Ġb ase
p ost
l in
t ail
M anager
ĠO F
.. .
ate g
4 0
G roup
Ġe lement
p an
In ter
Ġm ax
fer ence
ra g
A M
Ġ http
r l
a w
P oint
Ġ IN
Ġun signed
mp ty
ob j
h ost
re quest
] );
c a
7 7
Ġ lo
F or
ver t
f rame
co pe
S H
Ċ Ċĉĉ
ON T
he ight
re q
m ode
ĠP ro
ile d
I M
N O
Re g
ad i
ifi er
Ġc reate
me thod
i able
RE G
Ġm argin
act ive
act ory
V AL
I F
u ccess
b ottom
//////// ////////
Ġ message
f a
Ð ¾
Ġt able
lic ation
Ġp re
h as
ameter s
SE T
H T
lic k
RE F
t ag
ir t
a i
las ses
m enu
Ġc opy
O verride
Ġin stance
am s
Ġwh ich
) {
Ġp ath
li g
t ected
ct x
< !--
app end
A pp
m m
op en
Ġs ource
ï ¼
Ġon ly
s g
ã ĥ
D B
Ġin it
M M
Ġa b
a pe
d r
le ase
que ue
o ption
Ġp oint
T O
ith ub
Pro perty
b j
2 3
St ream
Ġp age
roll er
6 0
ch ild
vers ion
č ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
W ith
form at
n ull
u age
mi ssion
Ð µ
Ġo ther
] [
v ide
Ġc all
lab le
Ġcont ext
Ġm od
V al
E E
Ġ Ex
priv ate
im g
F ONT
) </
la g
Tr ans
f e
d u
C C
ĠĠĠĠĠĠĠĠ Ġ
id d
ms g
at er
bu ffer
h er
2 7
D esc
st d
B e
emp late
Ġb ut
an k
Ġo ptions
s on
ĠP ublic
St atus
Ġn il
g ithub
f lags
< ?
re en
Ġon e
U til
ER T
c s
B ase
p ush
Ġ$ (
p arent
2 9
Ġ ->
Ġ ,
Ġr ight
Ġa d
1 00
ol der
f ilter
C lient
Ġf a
P RO
8 8
R AN
ff ff
Ġp art
V E
up date
L o
name space
] (
In stance
Ġ* )
Ġd is
A s
t arget
Ġp rint
Cont ent
A ction
Re sponse
LA SS
end s
D ate
Ġ" ""
v is
M S
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ Ġ
param s
f irst
u me
0 3
Ġ> =
me ta
pert ies
ĠU n
I mage
Ġ 9
l p
EN D
ĠC opyright
ot e
b a
Ġf ont
at ive
Ġy our
2 6
4 4
se ction
st er
S tr
ĠA r
f ree
c md
ĠG NU
L I
m y
F rom
as c
Ġ/ >
d l
te ger
F IG
m ain
" ),
ig h
P C
à ¤
Ġ( )
ã Ĥ
L ine
Ġimp ort
Ġdistribut ed
ĠGener al
om ain
A d
Me thod
In put
f d
Ġl en
end er
form ation
B ar
i ct
tern al
Ġin st
at s
im er
Ġb oolean
e lement
" ]
N E
D R
b it
ial og
3 9
S ub
nav bar
con n
( _
u g
č Ċĉĉĉ
Ġa ct
j av
y mb
irt ual
Ġm ore
Ð ¸
0 8
t ab
F rame
7 5
A l
bo ol
Ċĉĉĉĉĉĉ ĉ
// /
f alse
Bu ffer
ment s
L ay
Ġtr y
t ree
IT Y
Ġvalue s
Ġhe ight
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠ
ĠĠĠĠĠĠĠĠ ĠĠ
% ;
he et
Ġoff set
' ),
Ġth en
ymb ol
Ġo per
c ache
c f
g oogle
CO DE
F O
ST R
3 5
Ġm ust
ĉĉ ĉ
Ġd isplay
st ream
B lock
Ġre p
( {
ĠT r
G L
Ġd ocument
ĠS ee
W indow
A ll
n s
me di
Ċĉ Ġ
Ġ q
ĠS o
P age
Se lect
ĠAN Y
o in
N av
P L
pro to
B ox
up er
k it
be fore
Ġr un
ow er
Re f
f ind
Ġf irst
Ġch ange
================ ================
rap h
d uct
Ġf loat
Ġ1 00
ĠRe turn
Ch ange
Ġ left
T ra
C P
ref er
SI ZE
re move
Ġout put
ERR OR
Ġ1 6
le m
orm al
3 8
ck et
m ark
E d
0 5
S ource
print f
riv er
at ab
Ġsize of
c all
def ined
p end
ol low
le x
il ity
c d
Ġw ork
d ing
Ġme m
ser ver
or s
Ñ Ĥ
c he
s d
H andler
} );
ens ion
o pt
Ġc al
Ġ using
fin ished
str ong
Res ource
K E
Ġa g
ab el
3 6
lo t
sh ow
Bu ilder
Ġm in
I mp
Ġre l
cp u
C heck
Ġso ftware
f low
0000 0000
ro id
N o
ĠW AR
Ġ url
En d
res ent
Comp onent
UL T
Ġwh ile
f loat
c i
ç ļ
. $
x y
Ġw as
ate s
IT H
çļ Ħ
a int
Form at
Ċ ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
r t
5 6
BU G
Tr ue
Ġdo uble
" ))
f ter
ref ix
al loc
Ġn um
AL L
Ġo ption
č ĊĠĠĠĠ
Ġm ap
St art
cont rol
ass word
N AME
ent ity
ith er
row s
c re
rit er
Com mand
V ar
c lose
ã Ģ
irect ory
Ġp adding
js on
e qual
Ġne ed
asc ript
u res
atab ase
ce iv
un finished
0000 00
v ider
b order
c ast
Ġ Ċ
a a
s pec
Ġa c
d isplay
p ng
IG N
N ew
Ġp osition
ĠE X
ri x
temp late
CO L
ern al
F unction
ĠL ist
N umber
ĠN one
st ore
2 1
apt er
an y
Ġ la
Ġs p
GE T
L ink
ack age
7 8
de bug
o ot
Def ault
ch ange
S ystem
n umber
Ġ us
P R
p ri
AC K
ĠD e
at ing
t t
Ġc ount
' ).
P er
C R
Ġin clude
o v
if t
\ "
u id
li ed
tot ype
M D
tribut es
At tribute
le g
ĠY ou
ĠWAR RAN
or age
MA X
out put
lig ht
H el
Ġse lect
ro ot
press ion
or re
F actory
ific ation
CT ION
ĠSo ftware
ĠO bject
S Y
ang uage
0 6
O ptions
Ġn et
Ġ* *
0 9
I R
Ġg ener
P ORT
4 8
ĠĠĠĠĠĠĠĠ ĠĠĠĠ
ad ata
ĠC h
B utton
s heet
Ġup date
M em
F ilter
R ow
cont ainer
u ch
" ).
r id
Ġ ar
al ign
ar ning
Ð ½
ul ar
to ol
Col umn
() ->
le ss
Ġbu ffer
r un
an sp
ĠH REF
A ct
Ġn ext
Ġ last
if def
ol ic
are d
2 00
Ġt ra
Ġn one
ub l
) (
jav ascript
g n
ec ut
ST AT
p o
S K
ĊĊ ĊĊ
iv en
M ode
0 7
ann ot
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
t mp
ĠI S
re quire
j ava
is h
G ener
ain s
ĠD E
Ġval id
ĠT est
AT A
c ard
3 7
Ġwith out
V ersion
F LA
O ff
par se
ĠC LASS
Ġs upport
Ġa uto
Ġst atus
imp le
tail s
U B
Ġfor mat
Ġ2 00
M B
ex port
To ken
Ġo ver
un k
Ġadd ress
Ġ ;
Ñ Ģ
Ġa ss
L abel
l s
Ġre sponse
Ġe cho
Ġf ollow
Ġt er
Ġm y
ĊĠĠĠĠĠĠĠĠ ĠĠ
y m
ial ize
L ength
g oto
v m
Ġg roup
Ġ INT
in stance
g ener
A SE
$ (
op er
ĠA dd
Ġto p
Ġpro gram
w indow
h andle
Ġm ode
Ġin to
M et
Ġs w
m atch
ateg ory
t ask
idd en
m ut
x x
ï¼ Į
s ol
a ir
T ag
8 6
, "
Ġm odule
Ġdo es
Ġ ]
ĠG L
Ġf ilename
er o
Ġe ither
C reate
com mon
le vel
A GE
c al
St yle
5 9
AN D
Ġ> >
Equal s
C I
ing le
Re ad
en v
in ue
Ġp arent
p osition
A nd
Ġc lient
O F
Ġcom mand
Ġthrow s
IN E
P RE
ĠW ITH
CH AN
adi us
Ġf ree
tr a
Ġdef ined
C ell
de sc
O per
Ġpro tected
N ull
R L
h ash
if f
Ġal ign
bu ild
" ));
ĊĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠ
ument s
ix ed
x ml
++ ;
c b
s i
unt ime
ud io
En try
v en
Ġw rite
li p
refer ence
Ġde vice
lat form
w ay
à ¦
ig ger
čĊ čĊ
B O
struct or
Ġo p
r u
Ġrequire d
Ch ild
Ar g
so le
m ask
ĠS e
T P
res ource
Ġ< =
v o
Ġ{ @
\ \
Ġm odel
5 4
re sponse
', '
X X
co py
emp ty
de scription
Ġm atch
olic y
h over
Ġi mage
reg ister
U I
7 6
ist s
he ma
S D
d ition
op s
Ġ( *
List ener
row ser
b in
ĠI D
read y
s ide
T ER
S R
Ġ[ ]
d f
A G
pro totype
Ġc ur
Ã ©
r s
FLA G
C ache
w ith
ff ect
Ġl ength
i k
iz ed
at tern
} )
Ġarg s
ens or
= >
Ġ ),
res h
ĊĠĠĠĠ ĊĠĠĠ
Ġ el
g ress
> ,
Ġa v
& #
ry pt
Ex t
Ġ RE
' >
i ss
web kit
Ġs k
S A
Ch ar
Ġp ort
Ġext ends
Ġm ake
in st
ĠC ont
Ġg iven
Ġl ink
p u
7 4
Ġimp lement
( *
S ON
pro perty
ĠT HE
In it
ic le
s or
a uthor
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠ
Up date
: </
IL ITY
id x
p lugin
d rop
c le
P os
par t
Ċĉĉĉĉĉĉ ĉĉĉĉ
f n
lay out
Re turn
W idth
Ġpro cess
Ġf ound
col umn
Ġc o
} }
å ı
Ġ ed
nt ity
I con
M enu
Ġ< !--
Ġc allback
se e
ĠV AL
Ġ? >
Ġ! ==
Ġs ol
pro cess
čĊč ĊĠĠĠ
m an
-------------------------------- --------------------------------
ack et
S O
en um
Ġin formation
######## ########
T arget
and om
Ġb it
% %
Ġin line
< <
ĠN OT
Ġ let
rap per
Ġh andle
ĠM e
ĠT h
n own
pe ll
Add ress
Ċĉ Ċ
lin ux
Val id
)) )
ound ation
do uble
Ġ+ +
D D
at t
8 9
Ġfile s
g gle
d a
in ce
H t
O S
f ul
I B
con f
io us
3 1
ĠC omp
Ñ ģ
o use
Out put
se ssion
IT E
w idget
Ġ label
i ent
P H
th ing
Ġ( "
und le
app ing
Ġ Z
Ġre source
Ġex pect
b ind
il y
Ġo bj
c lear
Ġc atch
at rix
em ail
qu ence
il er
č ĊĠĠĠĠĠ
by te
OR M
M ax
s end
`` `
U rl
T ask
Ġso me
Q L
Ġv iew
O K
Ġr ange
ir q
de st
Ġw rit
ĠC reate
d ocument
Inter face
license s
P art
ĠWITH OUT
Ġa ction
Ġpro perty
Ð¾ Ð
P tr
Ġin fo
Ġw indow
util s
FA ULT
ar r
ĠF ile
AT ION
Ġinter face
D C
f r
OR D
ĠAr ray
Ġli mit
w o
Ġf ilter
COL OR
ä »
enc y
com mand
4 9
Ġfollow ing
v ices
str act
EN SE
m er
T ree
ent ifier
P osition
A PI
ult ip
w ait
it ies
S p
Ġ local
Ġa fter
st ant
Ġpro vide
Lay out
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
UR L
ON E
Ser ver
U RE
e ar
style sheet
T his
. /
pan el
Ġal low
fo ot
Ġbe fore
set s
7 9
Se arch
IN S
Col lection
l ing
-- -
S pec
Ġs ign
Ġ1 2
f c
Sc ript
ri ption
Ġf rame
Ġ{ }
'] ,
Ġimp lied
Ġ2 0
r on
de c
Cont rol
Ġc re
P re
add ress
ad ow
******************************** ********************************
o se
ĠReturn s
P ER
PI O
L L
ĠH T
tr act
DE V
Ġt ag
IC E
N um
MA SK
che s
c an
", "
Ġser ver
g o
Ġspec ified
M od
Ġor der
C F
_ .
Ġ1 5
: "
N ULL
c y
l an
Ġex p
Type s
) ->
ot al
c enter
ĠT O
4 5
ex p
A RE
L ast
( [
ma il
CH E
Ġcol umn
IC ENSE
Ġt ask
x FF
MO DE
p adding
Cont ainer
EX T
6 5
li mit
Ġ query
LO G
C ase
ver y
Ġ( '
[ $
DI R
ĠF OR
ig inal
D o
m ote
Ġ load
g l
Ġse e
code d
p m
AB ILITY
IN D
V is
ĠF oundation
DE BUG
ĠM A
Ġ ::
p th
ĠF or
g en
s upport
de lete
ec ute
bo ot
He ader
A b
Un it
back ground
W rite
Ġf ail
M odule
Ġf ind
FI LE
{ {
Ġth ere
Ġf lags
bo ard
Ġ entry
Le vel
Ġfor m
Ġspec ific
ai lable
v ector
ceiv ed
ĠS h
CON FIG
un it
W idget
ext ern
o ther
ĠA n
p g
Off set
M ENT
D et
Ġc ache
A Y
Ġ ~
ser vice
cur ity
file s
ĠW e
S to
on ly
Ġ| =
i que
AC E
ult i
Ġd ate
Q U
ch annel
ĠA PI
h w
c us
' ))
Ġn on
set tings
v ol
E ntity
W R
6 9
Ġre f
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠ
image s
Ġex pected
Ġe ach
medi a
la p
Ġit s
c lasses
ĠT ype
r adius
a z
se cond
Cont roller
ĠF ree
o ve
=" /
6 8
č ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
He ight
Ġ ra
l ong
* )
R ange
c ent
u mp
to ken
IN FO
Ġch ild
w ard
Ġex cept
LO CK
KE Y
ĠS T
W eb
ĠR es
lo ud
Ġ row
f ull
l it
inter face
H andle
im um
Util s
Ġreg ister
rep lace
Ø §
F ont
se mb
b b
sm all
st at
â Ģ
Ġe mpty
Pro vider
c ap
A c
( !
Ġa p
Ġc ell
P AR
Ġ[ '
S B
iv ity
ac ity
Ġa ccess
Ġs ame
o le
Ġper mission
f inal
iz ation
pro ject
A SS
Ġo ld
a uth
ins ert
am ily
s ql
ex pected
Ġwh ere
D ATA
a uto
ix el
č Ċĉĉĉĉ
Ġ" %
7 0
ĠS er
Ġr g
value s
s l
se c
M in
B ack
Con nection
RO M
Ġ 32
in es
o ss
n ow
E mpty
D is
m argin
t en
æ ľ
ĊĊ ĠĠ
V ector
ire ction
c r
st amp
et ch
fo cus
Set tings
as ic
ĠA ll
C o
N et
c pp
th read
Ġby te
i an
s v
s ave
c m
Ġs uper
Ġh ere
D ir
P an
um b
Ġv irtual
F e
Ġl anguage
import ant
I E
ĠAN D
Ġo pt
Se ssion
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠ
Ġt emplate
en e
Ġn ow
Ġro ot
5 8
her it
str ap
comp onent
v ious
c at
ĠE n
A ccess
Ġin d
Ġv is
> >
å Ī
ren der
ãĢ Ĥ
M I
F E
Ġt mp
Pro cess
Par ams
u ction
N one
be gin
ĠV ersion
Par ameter
pre c
Ġo pen
R un
Ġbe en
Ġle vel
N ext
r ate
Ġby tes
S ER
Ġp os
un lock
cl k
ĠC heck
or ld
in ation
sw itch
w n
l g
dis abled
C urrent
Q ue
h s
im ation
ition al
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠ
p a
r ange
i er
cf g
H ash
c lick
C allback
Ġpar ameter
Nav Bar
Ġvar iable
P T
Ġreturn s
r x
A V
Ġst ream
ro y
ce s
Ġter ms
Ġpar ams
Ġsh ow
ĠD ata
F irst
a j
s ys
De vice
="../../../../ ../
Ġhe ader
al t
T op
use d
Ġf e
F R
a ded
co ding
Ġs end
Ġsw itch
pen ame
in line
mut ex
p ol
O pen
oc i
ĠC ol
Ġbu ild
C A
=" -
F S
ĠB G
Ġse arch
j oin
X T
(" %
Ġde tails
field s
D ocument
IN VAL
s ert
4 6
trans form
Ġin ternal
g lobal
Ċĉĉĉĉĉĉ ĉĉ
Ġt emp
sc ale
RE AD
com ment
TI ES
O ption
Ġre move
act er
s cope
s b
AL SE
Ġ' /
Ġfa iled
r ing
D L
S ION
A A
Ġth an
Ġp ri
b ook
p k
9 0
ä º
Th read
pos it
à ¸
Ġm sg
type s
sh ould
O ST
To ol
g ing
x f
8 02
` ,
to ggle
ad min
m ount
s ort
am l
Ġst ore
TE ST
Ġo verride
Lo ad
ĠP ar
Re cord
C ore
. "
lic e
ig ation
U D
ĠB u
Ġmod ify
al let
C all
IT ION
Ġh ost
O D
af e
me t
5 7
U ID
Ġs ystem
čĊč ĊĠĠĠĠĠĠĠ
mo v
Ġ Ã
b oolean
ĠA s
pe ed
-> _
Loc ation
4 3
9 8
ĠA R
ir on
Ġpar se
en able
Config uration
Ġbu f
$ {
s u
ers on
p ed
ubl ished
ly ph
AT H
ac cess
we ight
mem ber
4 2
sk b
Ġse ssion
Ġh ash
B IT
Ġde lete
I ter
ast er
Ġcon n
p op
foot er
Ð° Ð
Ġsol id
el y
A CT
G R
Ġc orre
V ENT
O M
ph a
ĠA p
ve lo
conn ect
W N
U SE
st ack
ma ke
() :
an ch
6 7
in ary
ign ore
ĠWARRAN TIES
U ES
T emplate
ru pt
ed it
n def
st op
ĠL O
as on
e cho
Ġal ready
MO D
s ystem
TI ME
S U
Ġde st
item s
33 33
ER N
R ender
c ustom
Ġcal led
i pe
str aint
B undle
á Ģ
ĠC lass
Sto re
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠ
~ ~
Ġcont ain
s n
Par am
br ary
ex ample
//////////////// ////////////////
b us
INS ERT
O p
Ġ qu
Ċ Ċĉĉĉ
ar m
t n
! <
ap h
ĠC om
th on
ĠA l
t ed
return s
if ndef
fo o
ern el
w ise
Ġ" /
ĠBG COLOR
re set
act or
25 5
type def
O B
by tes
c allback
ĠL e
ĠA L
Ġpro ject
Hel per
Le ft
P ort
__ __
Ht tp
; <
c la
Ġav ailable
Ġp ost
Ġname space
Ġ2 55
ializ ed
Ġre n
Or der
Ġre ference
Ġe ven
Ġg o
L EN
Ġp h
' '
Loc al
Ġo s
D ialog
t k
str uction
yn am
ç Ķ
ic ro
to col
Ġc l
Ġrg ba
in ner
S L
c ul
ĠN ame
ĠP y
Ġcon nection
## #
_ ;
ĠO n
ME M
c mp
d omain
Ġ Exception
STAT US
P h
Ġs uccess
p lace
Ġg r
ĠT R
Ġser vice
drop down
Ġcon dition
u k
ĠI O
="../../../../ ../../
ĠTr ue
å ®
ĠINT O
to String
.. ..
ĠCON FIG
Re ference
posit ory
Ġn av
IG HT
_ ,
g ment
=" _
( __
Ċĉĉ Ċĉ
equal s
Ġpar ameters
ce ll
r q
Ġ" ,
oo st
the me
tx t
ĠL og
) /
o om
Ġcomp onent
B E
x a
C S
ct rl
N S
Ġren der
s ing
7 2
g p
å ħ
ĊĠĠĠĠĠĠĠĠ ĊĠĠĠĠĠĠĠ
sp lit
ĠAp ache
St ack
i ction
let ed
ĠI t
gr id
sh adow
Desc ription
Ġ license
By te
Ġit er
ct l
ĠA ssert
ĠA pp
y nt
di str
ĠRe g
we en
Ġde v
a de
x c
. '
s ite
Ġp ass
Ġal so
are a
C D
f b
ver se
H ER
Ġb et
d s
at ures
x E
Ġ define
Ġex ist
RE Q
ge st
Pro perties
D raw
Ġat tribute
M atch
ug h
Re ct
semb ly
mod al
" },
ut ion
ance l
af ter
Ġw ant
Par ameters
N OT
Ġcont inue
NE SS
f lag
R T
S M
Par ser
b its
i od
( -
s uccess
ad o
bt ain
UL AR
u c
ang le
ĠD o
ib ility
Y PE
Imp l
In teger
Ġ em
x ff
he lp
( :
Ġth read
Ġt y
Ġj av
g ra
PO SE
Ġ' <
. *
co un
int ernal
iter al
and ard
I f
Ġpoint er
Ġd on
m g
ĠIn c
Ġv er
T itle
ĠP ART
**************************************************************** ********
h d
å Ĳ
ing s
Ġr c
ĠVAL UES
im al
Ġre ceived
h andler
so ft
En um
Ġal t
t ip
distr ibut
S k
CE SS
T X
ä ½
n one
F alse
Ġt ree
at tribute
Ġto ken
16 0
N T
> .
D IS
ĠD ef
CHAN T
f ilename
d river
Ġo btain
4 7
gr aph
Ġfield s
Ġm ain
UR POSE
Ċĉĉ ĠĠĠ
In valid
Ch annel
sol ute
Ġmem ory
ad ers
st ep
d at
Ġj ust
x F
ĠU p
ens ions
O bj
W ork
Ġch annel
Ċĉ ĠĠĠĠĠ
IT NESS
M T
)) ,
Ġse cond
co der
ĠP RO
A g
O ver
C lick
ide o
AD D
ER CHANT
T ABLE
D own
ro ugh
F UN
AR Y
boot strap
st ats
ut f
802 11
v as
ed ia
ĠP URPOSE
ERCHANT ABILITY
{ "
ri ef
Ġ ],
Con stant
IC ULAR
Ġl ater
8 5
i ag
R ule
m ac
T ab
d ay
i as
Ġen v
ĠD ate
Ġcont rol
tot al
H ost
ĠPART ICULAR
e ach
w p
f l
Ġarg uments
9 5
Ġ' \
x b
up le
Ġ5 0
pro duct
Ġd one
o th
ent ial
Ġd irectory
F loat
Ġ ent
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠ
sp in
lat ive
ig in
E CT
C re
ĠF ITNESS
} \
è ¿
ynam ic
Ġ ...
Ġre ser
ĠN O
P layer
or iz
he ther
="../../ ../
ent ic
b ed
Ed it
En abled
9 6
Ġm an
" .
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠ
Ã ¡
se q
re cord
PE CT
ca use
TR Y
d ated
l n
Ġf ull
)) );
reg ion
sk ip
rag ment
æ ĸ
ĠT o
x e
Ġre cord
on y
P UT
Ġinst all
ultip le
25 6
P S
'] )
L icense
ar n
0000 000
Ġd b
ist ory
8 4
() {
ĊĊ Ċ
ST ATE
key s
f amily
is ion
ĠV alue
B ASE
b rief
B R
U se
k ind
I DE
Ġ html
D isplay
ĠM ERCHANTABILITY
LO C
de l
S ign
P arent
c v
C al
b ers
Ġg lobal
G raph
Ġex ample
iter ator
U M
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
T A
tr ib
er a
W h
Ġg l
in ode
Ex pression
> ();
ĠE rror
= %
R ight
iron ment
lu ster
la sh
eng ine
TH ER
Name s
Ġ1 1
HT ML
Ġprovide d
8 2
Ġb utton
di ct
at om
, -
i i
) ]
T W
Ġm ark
e ad
A uth
Ġconfig uration
lic it
Ġuse ful
re port
Ġen um
h r
LE CT
Ġag re
fin ition
w s
By tes
Ex p
p refix
h igh
li de
Value s
ir m
R out
d raw
Ġ/* !<
h idden
Ċ ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
c ategory
ĠIn it
Ġtr ansp
L ICENSE
L INE
ri es
Re ader
Ġ1 4
j e
way s
Ġ lock
code c
k nown
Ġun defined
SC R
me d
"> &
d st
Ġresult s
ur i
h ome
Ġs cope
Ġb ox
-- >
CO MP
or ity
5 2
mo z
? :
f p
Ġb ody
Ġc pu
Ġapp lic
istr y
se ct
ist ance
VER SION
De bug
icon s
I X
Ġex press
D ATE
P P
u ff
he l
ol ve
J son
Ġc md
Ġs m
Ar gs
8 7
Ġright s
export s
pre v
end ing
sh ort
Ð »
Pro ject
Ñ ĥ
prec ated
Ġ} )
id s
ĠF alse
imp l
Ġex ception
ser v
ĠN ew
p assword
Ġm at
M on
-------- ----
i ant
ol ume
__ (
n p
FF FF
ex it
Ġc lear
O FF
select ed
L AN
5 3
P ackage
Ġ% }
ach ine
p layer
bo ve
ay load
"" "
r am
adi ent
Ġset tings
a h
r ad
E Q
il t
Ġpermission s
Ġ ĊĠĠĠ
s ync
Ġc ustom
oun ter
ge d
Ġelement s
Ġg over
d c
Ġn ormal
hed ule
Tra ck
la ck
R X
Ġp ackage
" ],
Ġj son
Ġtrans action
ĠM ath
B it
ĠN o
P U
P y
'] ;
Ġwrit ing
C ur
M sg
Ġval ign
Ġd if
ĠWARRAN TY
Ġf ore
HER E
r ule
I ST
Change d
oriz ont
Ġcont ainer
con nection
De lete
Ġp ublished
ĠHT ML
f ail
Ġrep resent
D F
CHE CK
ĠM ap
at al
B ody
P M
St orage
A re
c rypt
Ġtype s
9 7
E M
wh ile
UL E
f ix
ĠK IND
C MD
a iled
Det ail
r m
__ ,
ock et
TE XT
Ġ location
LA Y
j ust
Ġreser ved
x s
Ġbe cause
C B
En coded
Ġa bove
==== ==
č Ċĉĉĉĉĉ
M IN
doc s
s ample
e v
Pan el
S end
scri be
4 1
F lags
P lugin
end ar
ynt ax
Oper ation
æ ĺ
d p
Ġreturn ed
A ssert
inst all
Ġ https
P rint
in ition
ter m
frame work
z one
' .
ĠT H
Ġd irect
ce d
I ZE
Ġt wo
wh ite
Ġ ss
orizont al
t w
Ġ et
EN ABLE
Ġthe m
ĠN ot
module s
ick er
Ġre q
Ġc enter
Met a
Ġd iv
Ġd ir
ex ception
li ance
ound s
F ORM
Que ue
ĠTr ans
y y
Ġme t
čĊ ĠĠ
Ġ( _
Ġoper ation
art icle
S ymbol
lo y
Sh ow
; }
CL K
t imer
` .
sh ot
c ip
ers ist
pe at
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ Ġ
P ri
vis ion
b s
cp y
, '
Ġjav ax
en ded
um mary
12 8
C lasses
1 000
Ġal loc
S QL
Ġh andler
I V
å ¤
ĠW h
m c
Ġd own
R oot
Ġw ait
n on
pri mary
low er
x is
ĠI P
key word
Ġ2 4
CT L
W riter
Ġsh ort
L ock
W E
b d
Ġ[ "
Ġ" "
ator s
o us
L ong
f req
IP T
RE E
æ ķ
p lay
Ġand roid
ĠEX PECT
re m
Ċĉĉĉĉĉĉ ĉĉĉ
ĊĠĠĠĠĠĠĠĠĠĠĠĠ ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
d one
Ġ1 8
I VE
H as
G rid
{ }
block List
ert ex
Ġc a
s r
h ide
time out
è ¯
De finition
ĠO pen
MA P
MS G
Desc ript
sc reen
_ (
val u
X ml
co q
Ġde scription
pro p
Con n
m ar
Ġthe y
f g
Ġsp ace
Ġf in
d ialog
Ġc tx
Arg ument
distribut e
ĠU ser
ge x
7 3
bu ff
h dr
Ġw ord
le ep
Ġt otal
re lease
ent s
U s
isp atch
o pe
Ġlo ok
Ġd oc
M atrix
5 1
Ġ queue
w rit
Ġcre ated
event s
d im
P ATH
Ã £
Ġin teger
tr ack
K ind
Item s
D ITION
App lication
al k
Ġex it
AT TR
iz er
h older
pi pe
Var iable
Ġli ke
ĠU se
Ġsc ript
Ġd atabase
Ġst ack
Ġp acket
am era
ar ge
Ġ3 0
ome try
Ġ{ '
OP T
IF T
G e
PO ST
Ġr ule
CT RL
RE S
ac ing
ab s
8 3
Ġp lace
Act ive
name s
app lication
ĠLicense d
Ġp as
=" ">
Ġname s
h av
and roid
Ġli brary
DE F
'] ['
ializ er
w in
Ġab out
ut om
Met adata
Ġp e
By Id
) *
Ġ{ "
C ustom
x d
Ġn g
B oolean
ĠI s
x B
AR G
Ġf lag
Ġex ecut
Ġi o
D oc
B ind
M an
w arning
T L
[ :
Window s
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ Ġ
MA GE
Ġarg ument
6 3
ĠS H
As ync
9 4
Ġt x
Sc hema
Ġsc ale
Ġinstance of
Ġat tr
Ġre distribute
. __
lap se
g or
FLAG S
Ċ ĊĠĠĠĠ
p ool
sh ape
ĠF ALSE
LO W
ĠU RL
cl ar
g lyph
() ));
æ Ī
EL D
pro tected
j o
C M
ve c
ĠJ SON
Ġ ì
Ġp lugin
TE D
Ġapplic able
up p
v b
Ġc opyright
Ġex port
ĠIn t
pack et
sc roll
Ġ loc
Ġx ml
Ġ' ',
ut er
Ġe lem
al low
Ġitem s
ĠIn ter
c lean
Ġf n
M ock
or ies
arr ant
Ġfunction s
d irect
čĊč Ċĉ
č ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
A pi
j ob
I LE
w rap
b g
al y
c or
V er
T C
V M
Ġf unc
J SON
size of
Ġth rough
ff f
ĠE vent
model s
9 2
ĠCon fig
t l
ĠC O
OB J
ord in
B Y
M ark
> ::
apt ure
ĠTO DO
Ġassert Equals
Ġw arrant
U X
EN TRY
Lay er
d ma
Ġ" <
Ġact ive
Ġs ingle
f x
Ġal ong
ad apter
C RE
Ġ. =
Ã ¤
j query
SE LECT
Ð º
Ġ ul
6 2
C opy
Ġde bug
Ġapp lication
app ed
e q
r b
Ġi p
ut ure
Ġ1 3
ĠU SB
Ġb tn
Ġselect ed
ch ron
66 66
W AR
ib r
sc al
DE FAULT
Ġen able
] ]
Ġs ort
ac count
G B
Time out
çĶ ¨
Ġv ector
Ġcomp liance
p ag
9 1
c ar
c nt
6 1
tr igger
pl it
p latform
Ġass oci
ĊĠĠ ĊĠ
as sets
a u
Ad apter
ĠT ime
ĠF unction
Trans action
ĠCON DITION
ĠDef ault
mo ved
er m
Ġ- =
f ill
Ġm on
oss ible
dis able
Ġ$ _
leg ate
Ġ ignore
Iter ator
Ġh ope
Ġinit ial
. \
S w
Ġw hether
Ġwarrant y
0000 0
vide o
lang uage
Ġ" $
type of
D A
W e
w ner
ĠB AS
Ġg oto
VAL UE
en abled
tr ace
S cope
C an
Ġ[ ];
à ¥
ma ster
ub y
Ġ" -
page s
ab ility
D T
ĠS c
n ormal
AD DR
m anager
set up
] :
\ /
ue s
] =
Ġcont ains
Ġgover ning
x ffff
ĠS IZE
app ly
NavBar Cell
Ã Ń
Ġse ction
Ã ³
fer ent
ĠF ROM
IM IT
c loud
re l
ĠA S
Re port
ĠQ String
A ss
re al
assert Equal
er ge
DEV ICE
bl ank
net work
D ER
Ġ} }
å Ĭ
ĠBAS IS
ĠCONDITION S
Ġpro perties
tag s
av ed
pro file
SH IFT
ex ists
Ġtra ck
Field s
Ġbet ween
Ġobject s
Ġm ask
' ));
è ®
t ach
Descript or
In st
. ,
ch ip
Re p
par ser
G PIO
f mt
proto buf
? >
Ġ2 5
CF G
log in
ass ign
u a
W ORD
w rapper
M y
num er
R el
F T
Ġro le
s uper
Ġla w
get Name
assert Equals
Ġthe se
get Element
O ne
Ġ{ };
Ġin valid
J ob
ce ive
p ower
7 1
idd le
Ġp y
ĠL I
Ġevent s
par ator
En v
OR Y
CH AR
ĠN ode
Ġ$ {
Ġfore ach
urre n
Ġs ure
c er
lu g
Ġra ise
gor ith
IN IT
Ġpar am
Str uct
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠ
ĠW HERE
OF TW
Ġo ur
OFTW ARE
Ġst ep
Ġlimit ations
de lay
z e
x A
b c
cont roller
Ġpro b
Ġcon f
tab s
************************************************************************ ****
di a
A UT
ĠB O
D S
ĠA d
ĠQ u
ĠW eb
Ġb l
C lose
tr ie
F L
Ġadd r
d om
G lobal
let ion
ĠR ed
ire d
ater ial
Ġcon s
ĠMA X
N on
Test s
ĊĊ ĊĠĠĠ
D omain
p ass
Ġcondition s
Ġmethod s
Ġ ge
w r
ex pr
R C
E rr
th rows
is set
On ly
L IN
hav i
Ed itor
ĠAL IGN
9 3
pl an
ĠUp date
Ġor iginal
Ġw eb
E C
n ap
Ġagre ed
Ġre lative
K ERN
b ad
ir cle
ID TH
script or
Ġbe ing
ä¸ Ģ
M C
ke ep
ro ss
HE AD
yn chron
%% %%
Ġt e
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠ
g a
Ac count
pro c
s ig
point s
Ġre set
ed itor
s ymbol
N e
å ľ
P olicy
ĠE nd
Log ger
g reg
Ġ" ",
g h
SCR IPT
Ġo wn
ĠTR UE
E INVAL
S upport
F ailed
al led
File s
ch an
Reg ister
plugin s
Re move
m ath
Ġpre vious
F unc
Ġkey s
ang o
Par se
8 1
he ll
tr ic
Ġe qual
S uccess
result s
MOD ULE
L en
Ġ Ċĉ
Ġcon sole
X ML
Ġde l
= {
F IL
mo ck
č ĊĠĠĠĠĠĠĠĠ
A uto
t body
S UP
P ost
Ġu i
2 02
Net work
ASS ERT
w ild
F C
de tails
ĠS OFTWARE
coun ter
/ ">
Ġad ded
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠ
Ġb its
. ',
de pth
S pell
(' #
g it
ĠUn less
Ex pr
ur ing
Ġbe gin
b p
Ġm enu
icro soft
ĠB y
at tributes
N ONE
% ,
Bu ild
Ġb oth
Ġa cc
x C
") ]
= \"
Ġde pend
Â ł
F P
sh ared
": "
Ġinst ead
Ġs ave
Ġs ample
u ally
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
Ġst op
a udio
S ocket
Ġ ĊĠĠĠĠĠĠĠĠĠĠĠ
resh old
s a
Ġcorre ct
Ġ Key
M ain
LI ST
STR ING
Ġoper ator
ializ ation
Se lection
py x
as m
UN T
ne ss
Ġt ab
n r
Ġtrans form
=" "
US ER
) "
EL L
ĠB ase
. ",
so cket
ad ing
At tributes
Ġre port
S te
() ).
v c
Ġtransp arent
re gs
it ter
mo use
c hed
ur a
FI ELD
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠ
Ġun it
Do uble
ĠN AME
Ġre al
EN O
con trib
; ">
iction ary
ur face
th en
cont ains
com m
D atabase
qu iv
ON G
s oc
f i
ee ded
Ġp ut
Trans form
res er
j pg
age ment
dest roy
E VENT
] ->
Ġj Query
Ġ[ ],
Ġnet work
trans ition
child ren
var iable
leg al
qu i
ee k
E G
ĠO r
Ġ' ';
ĠS ET
Mem ory
Ġhe lp
s ive
ac y
ĠIn teger
P acket
Ext ension
} /
int e
Ġty pename
Ġerror s
t c
Ġ' %
gp io
comp iler
Ġ icon
M edia
ĠS ub
Ex ecut
Pro file
R ed
Ġp layer
P ool
cont inue
Lo ader
_ ->
co ver
p ing
Ġcon vert
ĠL o
k w
us b
. ");
Ġnot ice
Ġh ow
4 00
sub mit
Ġass ign
; /
B L
Ġpro to
Point er
================================ ================================
{ %
T imer
Ġact ual
Ġs ys
Ġd st
user name
print k
so ck
pro gress
Ġ 64
99 99
iss ing
ĠS PE
NU M
M ask
Ġdif ferent
Ġ< ?
)) .
Ġprint f
tool s
Ġtime out
Result s
ex ecute
ç »
R AY
co ur
um my
vo ke
n a
ar row
Ġc lose
Ġin sert
Ġstruct ure
W S
gn u
g ame
Ġn p
WR ITE
aw s
Ġto ol
g re
< !
Ġpas sed
T e
MP L
Ġcol lection
Select ed
č ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
g u
Ġother wise
p id
Ġ= ========
oc us
comp lete
ansp ort
ĠRe ad
Re quire
x D
a e
Sc ale
P ACK
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠ
z z
Ġt d
Ġind ic
Ġn s
Ġd river
wh ere
b oost
RE CT
ĠF orm
Ġac count
S PE
Ġ1 9
red ential
ol y
ĠC ode
sh ift
side bar
ĠT ext
ĠP er
Ù Ĩ
ext ernal
Ġc lean
b i
ol ver
Ġs ince
à §
Ġo cc
est ed
ro le
Ġa uth
in valid
} {
ant s
Ġnode s
Fe ature
IN ST
ĠN ote
as ure
a o
P A
ST ART
Ġ* ,
group s
W ord
aj ax
Ġbase d
Ñ ı
ĠLO G
or ation
Key s
co in
p olicy
tr ics
In ternal
Ġm d
Ġdoes n
: %
v irtual
D U
ĠU SE
ĊĊĊĊ ĊĊĊĊ
ma ch
G ame
check box
Ġ ĊĠĠĠĠ
CO MM
it u
h y
iv es
mem ory
ĠD esc
met adata
p ull
C CESS
v id
TI M
error s
(' .
D irectory
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠ
ann er
N C
FI X
b f
Pro xy
lo sed
us ers
} "
glyph icon
Ġlo op
) \
Hel p
r untime
tr l
proto col
S V
Ġp r
Ġc ould
ex ec
I AL
atom ic
Ġat tributes
AN CE
Ġsupport ed
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠ
et a
M ouse
æĺ ¯
R IGHT
} .
s ince
w l
E ach
Ġc annot
Ġtype of
ut able
Select or
D MA
] *
ĠI E
EX PORT
Ġag ain
' re
ĊĠĠĠĠĠĠĠĠĠĠĠĠ ĊĠĠĠĠĠĠĠĠĠĠĠ
è ¡
gorith m
At tr
å Ń
quot e
pro perties
Ġapp ly
com mit
Ġw x
A VE
Ġp refix
h pp
( @
ik i
w d
Ġrep lace
'] );
hed ul
b rowser
in herit
ĠG PIO
entic ation
Mem ber
col lapse
gr adient
ge s
ro me
c ut
C AP
Ġz ero
lip se
################ ################
Sp ace
C LASS
\ +
fo und
Ġm sm
A I
Ċ ĊĠĠĠĠĠĠĠĠĠ
Ġw ould
. <
Ġ EN
h ref
co me
Ġen abled
lin es
sv g
) ",
UE ST
O b
it ive
Node s
ver ter
c u
ĠS k
Ġj ob
Ġimplement s
Ġb ind
To String
ym f
S W
LO AD
sc an
á ĥ
ymf ony
ĠMe ssage
Ġal ways
i li
end or
AR GET
Event s
DE C
Ġ" ";
Ġli b
D est
INT ER
lo op
F lag
opt s
W rapper
Constant s
de tail
s afe
Ġh and
Ġp ossible
W IN
SO UR
res sed
æķ °
v a
de p
own er
th row
lo ader
r d
component s
Tra ce
ms m
In d
ra ft
UT E
R ole
sc ss
Ġ{ {
Ġdef inition
re c
r andom
ic ode
B AR
SP AN
id entifier
Ġh igh
log ger
Ġ1 7
print ln
Ð ¼
lig n
s z
">< !--
ĠC H
Con f
00 1
F ail
ĠL oc
TR UE
U INT
up load
du mp
al s
p ub
Ġp assword
vis ible
V AR
Ġsk ip
Ġb inary
Ġ END
J ava
Ġre lease
d ist
Ġtrans late
Ġo b
N ET
ĠS U
Ġdocument ation
W arning
Th at
C ap
Ġassoci ated
st orage
æ Ĺ
é Ģ
Ġs uch
ado op
point er
t ect
je ction
ul ator
F ull
fe ature
en ch
An not
act iv
Ġro t
Ġ ];
Sc roll
() </
ĠO ption
i um
FF ER
ĠA t
State ment
Ø ±
WAR N
Ġ& =
Pro tocol
G EN
oper and
ty pename
Ġadd itional
] ))
R I
En g
i ed
] +
F ound
pro ps
(' /
= $
al ys
ath er
Ġab solute
ĠA SS
: #
Ġcur sor
L im
Ab stract
k ens
AR D
l us
Ġwith in
ĠD B
Ġ entity
se curity
P attern
UT F
Ġ201 5
ce l
ĠH t
Ġchar acter
ut es
M ac
Ġ1 000
ys ql
ert ific
à ®
hel per
f lex
Ġv ert
LI B
ĠO ut
col lection
us r
Ġ ----------------------------------------------------------------
gra de
R untime
å °
ĉĉĉĉ ĉĉĉĉ
ub e
Ġf ix
MA C
lo ok
Ġs ymbol
Ġchange s
US B
/ "
Ġm achine
alys is
An y
č Ċĉĉĉĉĉĉ
cre ment
Ġd omain
UN D
å ¼
at io
Ad min
Act ivity
ĠIO Exception
s lice
OR S
E ffect
ä ¹
N V
Imp ort
S imple
rad io
T emp
-> {
N D
Vis ible
Ġp op
Ġw ay
IL D
B B
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
Not Null
index Of
Ġ" .
r g
UP DATE
M apping
Ġthe ir
č ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
Ġm ock
Ġid x
() ))
require d
p icker
' }
s f
Ġ ).
Ġl ang
Eng ine
enc ies
S ave
Ġin v
j ango
ĠReg ister
Ġn eeded
ĠDE FAULT
ak es
Ġ ĊĠĠĠĠĠĠĠ
SY S
T S
Ġm ultiple
der r
TH OD
Ċĉ ĠĠĠĠĠĠĠ
re ct
h ci
E Y
he s
č ĊĠĠĠĠĠĠĠĠĠ
ff ic
Ġ\ "
node s
CL UD
Ġset ting
b log
CLUD ING
EE EE
al le
sc hema
Gener ic
" ].
b ound
ca ption
ay ment
oc aml
medi ate
se l
Ġf mt
z ero
t f
mo b
E l
Ġm atrix
T x
Ġb ottom
ĠD O
on s
annot ation
V IDE
ĠSt atus
ĠP oint
h orizontal
al f
Ġ mp
Y ou
P F
ĠB it
Ġb r
Ġgener ated
Ġd im
ch art
e lem
Ġa pi
3 00
Ġwh at
velo p
Ġchar set
n ost
M ove
Ġchange d
ĠH ash
ĠV ector
CT YPE
sh ip
Ċĉĉ Ġ
Ġv ia
dr v
head ers
! !
ĠP H
ts d
mat er
Pro duct
n l
Ġd raw
SU CCESS
Ġp latform
sum er
m ix
Se curity
St ats
par ameters
Ġstr ict
CP U
ĠASS ERT
/ _
h a
P refix
ex tra
Ġm ove
for ce
Ġe very
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
Ð ´
Re pository
re qu
Ġh idden
v ance
ro t
v t
Ġc ap
sp acing
b ot
Ġas ync
Ġlog ger
Ġcon structor
as ync
Ġimplement ation
cul ate
Ġinter rupt
Ġset up
ĠW indow
Ġsm all
O W
Ġ ON
Ñ ĭ
el f
S ort
Ġnull ptr
Add r
99 9
Ġ= ======
act ers
oper ator
ĠCON TR
Ù Ħ
ro und
Ġt ri
in c
, $
z ip
Icon Error
Ġa uthor
a ut
Ġpro duct
m u
Be fore
Id entifier
AT CH
ĠMe thod
M ulti
V ertex
Ġ' '
PAR AM
Ġo k
M ath
Ġex ists
IconError Encoded
v s
spec ial
Q t
mb ers
re spon
ist ics
Ġ4 0
P r
ORD ER
Sh ape
he me
Ġde c
not e
Ġ ĊĠ
m k
Ġ$ .
ĠN umber
f ixed
Com mon
ĠI F
ateg y
S UB
on ce
h i
ĠL ICENSE
ĠS QL
Name space
č ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠC ELL
ĠArray List
Ġso cket
Ġs u
" `
ubl ish
ä¸ ª
Ġbu ilder
Ġac cept
con sole
B ACK
Ġ ^
æ ī
ĠRe quest
Ñ Į
E P
cond ition
G O
Ġconn ect
ĠD is
F in
C UR
resource s
Ġg raph
å Ľ
B its
Ġper form
qui res
E ST
d iff
ĠU N
ex pect
ĠIn put
s y
en code
C ategory
ĠO THER
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠ
BU FFER
Ð ²
la in
action s
urren cy
j Query
BY TE
Ġ Â
re peat
Ġs nd
SS L
T otal
Ġme dia
Ġ( );
> '
ĠI mp
att ach
Ġ( %
id ent
f w
high light
L anguage
T AG
Ġrun ning
Ġex pression
ol ution
N G
Ġp an
aa aa
Ġse quence
Ġw allet
lo or
ret val
EEEE FF
DO CTYPE
S ample
De c
riter ia
ibr ary
cur sor
cour se
Ġi m
c n
er iv
ens ure
Ġv m
Ġbe low
P assword
Ġpar ser
h adoop
Ġr andom
ĠA ct
ĠK EY
Gener ator
OP Y
H R
im ate
ol l
SE L
= -
= (
Se quence
(" #
ache d
ss er
3 77
fore ach
DE X
ag ent
Ġf ill
ĠA b
Ġtest s
ĠM ake
ul lable
Ġw r
Pro to
ĠV al
Ġe st
p are
Ċĉĉĉ ĠĠĠ
utom atic
Ġc op
A lign
Are a
bu ilder
Reg ion
Ġ à¤
B rowser
nap shot
Detail s
object s
pe ar
ĠI tem
Ġp attern
Ġsc reen
% "
Ġ" #
Ġ raw
Reg istry
å į
ĠS ource
k a
ig r
ou gh
Ġs ide
p ad
ss l
pro xy
sp i
nav List
d up
HT TP
ure d
it al
Ġgener ate
/* !
Ġg en
all classes
AR CH
čĊč ĊĠĠĠĠĠĠĠĠĠĠĠ
V EL
ĠC OPY
å ¯
A v
support ed
k t
Ġ' "
A F
P air
p attern
SOUR CE
res ses
Ġop acity
p dev
Ġ es
tr ies
rom ise
P e
ro ute
re v
Ġtr igger
ĠF ield
T K
F OR
O pt
L C
CO UNT
not ify
pe t
Ġ201 4
å º
par ameter
Ġel if
Ġ email
NavBar Font
L Y
th umb
Text ure
ch unk
J S
f etch
Con dition
t v
esc ape
~~ ~~
Ġ' .
valid ate
col Last
sign ature
content s
00 01
St at
Ag ent
b at
g reen
il la
Ġv ol
T UR
ĠJ ava
is c
Ġwh ite
Ã §
B l
un ique
mater ial
ĠWh en
Ġs pan
UR I
__ );
t m
x html
(" /
Con straint
ĠD A
ph y
ext end
OBJ ECT
at ile
TR ACE
cl one
Ġsh ift
o od
C md
Ġde sc
ang ular
Ġvariable s
M at
t ile
mit ted
Ġon ce
Ġi ss
A fter
Ġpoint s
cont act
istr ation
Ġ(! (
Ġoption al
str ict
Se cond
Ċĉ ĠĠĠĠ
Ġlink s
D b
e ffect
ĠC o
Rout e
Date Time
Ġi mg
oo g
fl ush
Ġs ent
Ġs ql
D iv
ar i
Element s
(" \
ul ate
Ġmessage s
Ġc ore
ĠH e
D uration
p in
L S
r uby
l ers
Ste p
Ġ' #
| |
Ċĉĉĉ Ġ
S ync
ch ain
col First
ä¸ Ń
Ġ keep
get Value
ì Ŀ
Ġ0 0
P AGE
v es
lo s
ĠÐ ¿
Ġb ound
mer ge
al pha
Ġapp end
c lock
ĠSt art
line ar
ĠA nd
con structor
INVAL ID
B LOCK
ĠV iew
S G
k s
Û Į
Ġdis abled
Ċ Ċĉĉĉĉ
ic ate
Ġexist ing
: '
Ġfe ature
LIN K
hedul er
Ġa mount
mark s
() ),
r ank
Â ¤
Ã ¥
( /
Ġus b
orre ct
p air
g ative
m al
ĠT ra
C ALL
g if
Ġend if
FUN CTION
Ġcontain ing
P lay
ĠL IMIT
g c
1 01
Ġcol span
Ġb ar
B US
Ġhe aders
G RO
un ch
Ġallow ed
L D
Form s
clu ding
Se ction
Pro gress
Ġin herit
co ok
Ġ6 0
am age
head ing
Inter val
Ġ ×
Ġsub ject
ĠI MP
Ġex tra
al ert
Ċĉ ĠĠ
Y Y
lo aded
s lot
clar ation
fe ed
li k
Ġl ines
Ġ č
Sk ip
ĠP CI
y es
Ġ layer
b le
havi or
arg v
b ig
is Empty
Ġm ov
S o
d m
A ST
j a
OFF SET
un defined
Ġed it
ĠX ML
bl ue
ĠT ask
ĠI mage
ul ation
k ernel
ro ad
IR Q
ĠQ t
Ġch unk
h ip
__ _
ro s
F ree
mat rix
ight s
test ing
gener ated
var s
de pend
F ind
iz es
ĠA uthor
ĠS D
Sc reen
ĠC re
log y
D es
sp end
al ance
P IN
db g
Ġwrit ten
Ù Ī
Ġun til
str ip
Ġp resent
Ġopt s
y cle
l legal
ertific ate
it es
con struct
F B
I SE
Ġp erson
ick et
Ġcont roller
Ġc lock
) ">
A uthor
arch ive
ĠGet s
co very
P Y
al th
] ['
F older
G r
Ġext ension
iag nost
U ST
åľ ¨
) [
RE SS
F ix
Id s
at ible
R ate
F D
W A
Return s
p ow
æ ł
down load
Ġdis able
FORM AT
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠ
cur r
LE TE
C lear
Ġ2 2
DB G
Ġs um
ro ke
ĠM em
____ ____
' =>
Ġp lay
Sh ort
Lim it
quest ion
ces sed
** /
ar ies
ceiv er
G TH
r v
Ġan other
FA IL
d ot
LE VEL
> ';
s ensor
N ormal
Ġs im
Ġin ode
Ġmem ber
is on
5 00
Ġm ac
ph one
s lide
G UID
V R
du ce
ic a
Ġmet adata
a ff
Ġb rowser
ĠT e
ĠH andle
em ent
â Ķ
V ideo
A X
Ġs b
W M
B ound
con s
Ġto o
H AS
itu de
te gr
V olume
: (
T ile
check ed
ĠIn dex
ir d
Ġ REG
la ve
sl ider
use s
Ġs ite
Com ment
Ġ ë
in f
Ġe q
in ux
gn ore
H O
s ingle
id ate
Ht ml
view s
T ri
CON TR
clu ster
ĠLe sser
A li
ĠW rite
Ðµ Ð½
getElement ById
Ġmax imum
Ġcon tribut
ĠHt tp
Ġpre v
S ingle
ook s
ĠG oogle
Ø ª
V O
D im
Ġstring s
Ġcurrent ly
Per mission
se quence
$ _
ĠRe move
MB OL
æľ ī
MB ER
ĠM od
De pend
ĠHT TP
Ġover flow
P K
CO M
Ġs imple
L ower
ser vices
ĠR un
Ġp tr
ĠB Y
PH P
n il
Ġre moved
Ã ł
& &
Ġinclude d
comp are
; "
ãģ ®
H AL
Ġup dated
ook ie
Ġsc roll
inte ger
Ġd uring
f actory
bo se
=" <?
ĠD MA
d k
ĠB e
Be an
bl k
Ġst at
Pro ps
ateg ories
Ġ layout
r ic
change d
Ġw idget
t ure
ag ing
ue st
pc i
** *
re st
de g
p b
Ġd ay
g ui
ĠTH IS
Ġat t
ĠS Y
li er
oo se
mp t
Ġ[ [
ĠD et
Ġso ck
LI ED
Ġe ffect
ifi ers
and s
TR AN
Ġuse s
m apping
L IC
Ġcom ment
l ush
w x
c ircle
redential s
d x
Ġneed s
Ġm ost
DI O
ck er
mb da
Ġ( &
d atabase
al ar
ME THOD
P D
Ġtrans ition
if ies
d uration
y ear
ĠN e
s peed
Ġh f
Draw ing
Collection s
ĠS tr
> \
D river
Ġsh ape
A W
5 12
P op
Ġw arning
ax is
w arn
Ġw ere
Ġlo aded
Ġa void
em on
re mote
> :
Ġreg ion
av es
ut down
Ġcomp lete
Ñģ ÑĤ
D ay
requ ency
ang er
ar p
ee e
($ _
ĠB oolean
de code
d irection
'] ))
AT OR
ĠA T
Â ¡
Pro p
AT URE
pend ing
ec lipse
Ġ' ,
del ta
vol ume
s imple
age d
re sp
I MP
__ )
log o
ĠN S
.. .</
Ġv ideo
TUR N
ĠH el
H AND
Ġme ans
LEN GTH
b asic
> "
Un known
time stamp
p d
Ù ħ
ĠRe act
I Z
g i
per i
look up
Render er
PO S
Ġp ower
L at
ä¸ į
ĠB UT
Ġset s
R PC
FR AME
con vert
last ic
ĠO UT
Ġrequest s
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ Ġ
F ALSE
ans w
: \
Ġa wait
Ġent ries
ĠT YPE
Ġtype def
LO B
Ġcom mon
ĠC PU
Ġb us
å Ĩ
ĠRes ource
S top
> )
Ġm ight
ãĥ ¼
z er
Ġblock s
t cp
Ġ(( (
n i
column s
SY MBOL
G PL
f lat
Child ren
ĠBu ild
Ġap pro
ĠDA MAGE
Ġst ill
m ulti
Bu f
c ancel
Ð° Ð½
Ġst orage
W orld
čĊč ĊĠ
U ri
MA IN
ĠS E
Ġde p
Se c
to uch
ter min
f older
RES ULT
Ġnav igation
Ġ" ;
Ġhe ad
Ġvis ible
Resource s
Ġver ify
201 5
ffff ff
OR K
I t
ĠM odel
ĠBO OST
ĠN AV
Â µ
in v
ĠW IDTH
DI V
Ġlist ener
A CTION
P rivate
ĠM y
en ers
B r
Ġe ase
Ġpro p
å ĩ
ĠC OL
de precated
G A
ot ion
web pack
Ġp ixel
iz ing
IS C
t bl
P LAY
-------------------------------- ----------------
Ġp ipe
Ġd irection
Ċ ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
Ġ" >
re store
ĠI d
Ġun ique
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠ
ĠO per
Ġ' _
g y
ĠE VENT
Ġchar acters
an e
ãĢ ģ
ĠP R
map s
Ġse lection
Ġext ernal
ĠP h
ap er
ref s
er ved
fa iled
_ )
ĠPro ject
Ġ low
or iginal
ch or
p ixel
Ġt imer
ri end
p df
Ġy et
Ġme ta
Pro gram
Ġm erge
Ġex ecute
R F
po se
00 2
Ġre ason
Ġc b
vert ical
get Id
En able
sign al
link s
Ã ¶
j unit
Ġfor ce
D M
Ċĉ ĠĠĠĠĠĠĠĠĠĠĠ
ress ion
REQ UEST
DO M
ĠT ABLE
ac cept
Ġc luster
if orm
sh are
ĠC al
ed ge
pe g
Ġp air
SS ION
st derr
Ġcall s
attr s
Ġd iff
cre ated
201 4
_ );
Ġ ##
Ġ rows
AT ED
Ġspec ify
se lection
reference s
Ġc lick
l arge
ĉĉĉĉ ĉ
å Į
Cur sor
{ $
Id x
Ġid ent
let on
Ã ¼
S ql
iss ues
ĠB lock
tr im
G en
Ġ2 1
option al
Ġg rid
E mail
r al
P a
Ġus ers
Ġse c
or igin
>< !--
Ġpro tocol
element s
ĠSer vice
o ard
AN T
ĠS pec
o ice
res olve
Ġh old
ava i
Ġ2 3
st mt
ĠT able
ation al
Ex port
Ġch ain
App end
De cl
Ġcontent s
BU ILD
w atch
py thon
Ø ¯
u uid
d irectory
ĠC HE
F N
ĠN E
x t
m un
assert True
LA B
ra se
" \
' ):
Ġ_ ,
for med
Ġg u
il ities
form s
ĠA V
ĠIMP LIED
é ĩ
Al low
DO WN
NO DE
Ġc ls
Ċĉĉĉĉĉĉĉĉĉĉ ĉ
P ass
cl us
sp ring
! =
tool tip
$ $
Ġchild ren
h l
Ġ" );
mit ive
L ook
r ont
mi ss
Ass ign
Ġat om
cd n
Ġspec ial
serv able
f ly
Se e
Ġc ard
ac c
mon th
mi se
A udio
ĠH AL
Ġen coding
Input Stream
cal endar
ĠA ction
ad a
Â ĥ
Ser vices
Re al
ĠP ath
u f
an imation
dis k
trans action
Ġselect or
p v
Ġp ool
C ounter
Ġpage s
arg uments
m id
Ġcorre spon
F n
Ñ ĩ
at ar
ob ile
ĠSet s
z y
second s
-- ;
P ixel
In sert
D irect
set ting
Require d
Ġs d
( %
w m
G ui
Ġp a
Ġpro xy
u pt
CONTR OL
USE D
Ġd rop
Ar t
C luster
Test Case
test s
h and
W ait
f lu
å ¾
ĠAr g
qu are
Ġh app
Ġv ec
kw args
Ġre mote
ĠDesc ription
P TR
ĠU I
Ġm apping
rep ly
Ġt ake
A xis
ĠF T
f il
Ġread only
Ġk now
DE D
d ig
read er
End point
du ction
Inst all
Ġ" '
Ġg ame
c li
ĠCHE CK
æ ³
æ Ŀ
res ize
de cl
e quiv
pre pare
aw n
Ġc ounter
b on
EN CE
BU F
pre t
================================================================ ========
B C
ĠN et
Point s
PRO C
T ARGET
ut ed
B inary
m ag
T y
ĊĠĠĠĠ ĊĠĠĠĠ
Ġ1 02
Ġ ensure
F low
trie ve
Ġs peed
L iteral
C opyright
ĠLIMIT ED
Row s
Ġre ct
ĠEn able
Ġun less
p data
v endor
Ġassert That
Event Listener
J oin
pk g
He aders
as sembly
k er
S u
ĠP re
t le
D V
v let
Ġc lasses
Ġinit ialize
s core
ĠD ocument
il li
Ġstore d
ç Ľ
get Instance
( \
STR U
Method s
// !
Re set
IN DEX
ĠS C
Ġde s
Ġf ixed
IO Exception
Ġsc hema
Ġhe l
Ġde lay
D P
Ġ' </
ĠOut put
ĠC an
s ass
var iant
inter val
s im
b ra
int el
ex ist
Ġcolumn s
ĠNAV BAR
C ast
ï¼ ļ
s q
Ċĉĉĉ Ċĉĉ
can vas
Ġ>> >
St atic
temp t
En ter
P lan
message s
S ymfony
ĠLo ad
ate way
block s
Con structor
Ġab stract
anch or
main ing
es h
s nd
ĠU SA
our se
n ail
d w
b atch
ud o
.... ....
ic o
Ġc la
g ht
Ġin struction
» ¿
pro gram
Ġdistribut ion
select or
ĠC all
or p
A MP
loc ale
cess ary
Ġg ot
F ragment
Enum er
Ġsign al
Cont act
word s
method s
ur s
Ġ' -
d isp
UB LIC
ext ension
p resent
== =
ip her
CRE ATE
om ent
Ġm any
RE D
er ies
Ex ample
ĠSt ate
Ġf s
ï »¿
ent ries
Ġall Classes
sw ing
er ic
ist ers
(( (
ard ware
Ġc r
} },
ĠallClasses Link
trans late
æ ŀ
Ġpro gress
B asic
OPT ION
Ġmat ches
O C
> ../
-------- --
H igh
Ġfail ure
F ocus
Al loc
ĠD ATA
gener ate
Ch ain
Ġp ush
R M
ur al
ĠRed istribut
p lot
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠ
Ġpro file
Ġm ut
Ġb ad
Ġ ..
Frame work
per iod
čĊ čĊč
G IN
D Y
ä ¼
AR RAY
Us ers
ä» ¥
Ġd ict
File Name
mm utable
8 00
pro vider
Ġa utomatic
lic ate
ĠB E
ĠCol or
11 1
Ġem it
I ME
OR TED
ar sh
O wn
Ġ` `
á »
H OST
v i
ter s
Ġtag s
FUN C
ĠC lient
e ver
FFFF FF
Ġ" _
f ire
Ġvert ical
EN C
Re lease
(' <
Argument Exception
Ġs plit
if est
Ġline ar
Ġcell padding
Ġal pha
Mem bers
L ib
urn al
Ġo wner
ro ut
ĠE d
os ite
h c
RO OT
æ İ
se g
b lob
Ġcell spacing
rt l
C ard
em it
m ux
è ¦
dec oration
Ġ er
! [
Ġle ast
velo per
+ "
al ias
H D
( .
i os
te ction
B ool
ick s
M ake
ap os
c ing
PL L
Ġc p
ĠCol lection
ĠLI ABILITY
R aw
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠ
R et
Ġf older
ĠQ gs
C la
201 1
Back ground
Ġb g
Ġsk b
Ed ge
e h
ĠP age
An imation
ar io
ĠV er
ĠE lement
z on
l ider
ĠO P
R GB
ĠG roup
ĠCOPY RIGHT
ç ½
DI RECT
S PI
T F
config uration
ĠÐ ²
over view
as y
ä» ¶
Ġst andard
{ \
full y
our s
+ =
S m
Object s
am az
li o
Ġed itor
es ome
exp and
P ower
Ġs ync
Ġ{ },
Ġa xis
S pan
Ġ ĉ
ĠVAL IGN
Conn ect
Ġd id
Ġre ader
Ð¾Ð ²
li ke
IN PUT
r f
Ġresource s
s leep
fe atures
201 6
un def
Ġ{ %
AUT H
; ;
ĠWindow s
ĠS ome
string s
it ed
nav igation
Bind ing
p atch
ĠM O
Ġf printf
D rop
B A
ap is
ct r
h f
Ġvalid ate
road cast
Ġde scriptor
Ġp ur
re et
Ġ? ></
ĠEx t
Ċĉĉĉ ĠĠ
ĠPro cess
Ġ201 3
m ult
Ġro ut
Ġc fg
æĸ ĩ
Ċ ĊĠĠĠĠĠĠĠĠ
d n
å ½
Ġ& #
S ummary
P ublic
Not e
Log in
Ġt s
M R
SER VER
Ġ lower
Ġk ernel
' \
Ġa udio
2 000
12 3
N ative
T erm
ĠSe lect
sc hed
De legate
Con verter
ĠS w
lik ely
Ġv olume
C G
V ec
Ġ que
U Int
ord ing
In v
g on
d ash
ip s
Ġmodel s
Sh ared
label s
Ġis set
f ra
cook ie
In s
d ark
Ġin cluding
F ace
In formation
SS AGE
amaz on
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠ
s pell
filter s
copy right
ĠCom mand
ĠCh ange
frame s
å® ļ
I I
ĠV ar
rep are
w ake
åı ¯
Group s
Ġtime stamp
W ER
F G
an a
Ġenv ironment
ä ¿
N EL
6 00
so me
AP P
Ġd ist
ific ations
CODE C
const ant
Message s
Ġr ate
lib s
TO M
pk t
C trl
] </
Ġ-- ></
ĠCont rol
err no
C l
ed s
Ġdel ta
Error f
H older
V T
r pc
tool bar
ra in
load ing
se m
Ġf ace
GRO UP
writ el
MM ARY
ĠA UT
Ġan imation
Ġm ouse
ĠF rame
D TD
ul k
I gnore
Ġm s
Oper ator
mat ches
) }
Ġ enter
G LE
function s
v p
rag ma
Ġy y
B ook
Ð ¿
Ġ/** <
\ -
d rag
Ġ201 7
Ġus age
Ġexp licit
create Element
Ġd i
os er
reser ve
RO W
ser ial
j ax
PH Y
Top ic
SER V
li es
d anger
ry ption
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠ
B order
č ĊĠĠĠĠĠĠĠĠĠĠĠĠ
Ge ometry
ordin ate
R andom
N ON
ĠRes ult
li m
script s
S N
Ġf actory
l v
sub ject
Th row
fr ont
Ġf d
ins n
Ġet c
w b
à ²
s id
ĠA DC
Ġad min
ug gest
mach ine
Ġare a
h o
u ce
n of
Ġ' ''
Us age
b and
Ċĉĉ ĠĠ
ph ys
Ġpro ps
comp ute
W allet
Z one
ilt in
Ġw ell
for Each
Not ification
gener ic
Ġar ia
G u
Ġse par
UN K
ĠIn st
ĠS TR
De v
Gener ated
alle l
de s
Ġn ative
numer us
mo re
numerus form
s ym
Ġ à¦
Loc ale
in a
] ),
pp ed
A p
ĠP rint
Comp lete
str cmp
av ing
t i
B T
, ,
IT S
ĠS end
Se gment
sc hedule
12 7
tw itter
iv ely
/ .
sh a
ĠL ink
LO T
avai lable
Ġ Ø
Re v
Column s
de scriptor
ĠAb stract
pr ice
H W
D el
def er
Ġed ge
ILE D
IF Y
Ġs printf
Tag s
ĠI llegal
KERN EL
Ġid entifier
am ount
Error s
$ .
get String
init ial
LOB AL
Ġp ayload
st ar
ĠC A
lap sed
sw arm
RE AM
and ra
ĠF ind
Co ord
Annot ation
Ġ_ .
Ġrot ate
` )
li brary
' },
vo ice
ĠBu ffer
è¡ Į
Ġrequest ed
str iction
ge ms
Î ±
Ġz one
ĠO ther
un der
Re mote
ĠA c
i ke
Ġsh ared
us age
t ax
. """
Ġs upp
ad s
LE D
date time
Ġs pell
n x
ä¸ º
ct or
Ġc ref
Ġoper ations
k free
P G
Set ting
ĠSer ver
p ayload
D rag
Ġm o
Menu Item
Ġsc an
M AN
ĠOption al
ĠAdd ress
Ġstr len
Ġs lot
DE P
Ġ Ñģ
Process or
pe er
Ġ' ./
ad io
IG H
se gment
Ġm anager
ĠW ork
eriv ed
ĊĊ ĊĠ
Que st
p ic
P lace
W ORK
ser ialize
col lect
Ġcommand s
over lay
comp ile
wild card
R UN
lu a
Ã Ħ
ĠG ET
Ñ ĸ
set Text
PRO TO
Ġdirect ly
mob ile
ĠBy te
lo ts
ver ify
ĠR T
Ġs ig
Ġsecond s
Ġ3 1
Ä ±
CON NE
æ Ķ
un g
ĠQu ery
å Ģ
ĠS p
å ¸
h istory
wh en
Valid ator
Ġde scribe
vent ory
Ġ( __
.* ;
up press
Not Found
Ġse q
Ġ( `
ĠD OM
m alloc
Ġd ynamic
il ation
st able
B atch
in o
ouse l
ĠSU MMARY
class Name
> ";
Ġ' $
* (
ase s
R D
=" '
Ġ2 8
te am
Con sole
q t
mem cpy
top ic
Â »
Ġs aved
Ġun known
) +
Ġar r
ass andra
ĠD ec
* -
Ġco q
Ġconst ant
; |
u la
Ġp l
h p
čĊč Ċĉĉ
è §
H ome
u ed
%%%% %%%%
ab ilities
refer red
P latform
Pre v
over flow
Ġm aterial
Ġre sp
wild fly
QU AL
50 9
c ert
LO AT
time s
ier arch
ordin ates
12 5
MA KE
="../../../../../../ ../
sn ap
;& #
P od
A mount
D irection
R ot
id ual
De pth
Ġre ceive
it o
ĠI R
Ġa ut
Ġbe st
Ġb in
Ġp olicy
w t
f ast
O wner
Re q
ĠPro perty
atal og
å ¹
Ġin side
Ġd ialog
OL DER
Ġpan el
X Y
Ã Ĳ
spring framework
B ounds
ĠS V
ĠM an
Ġpro vider
æĹ ¶
, %
ine ss
> ;
Ġdest ination
m x
Ġt sd
SO C
ĠST ART
I A
Comp ar
} ",
H and
aw t
SR C
mm c
ITE M
ĠT IM
ĠEx ample
ĥ ½
Valid ation
p ersist
SP ACE
Ġse gment
Ġex tract
th at
ex pression
c g
pag ination
ĠSPE LL
AL LOC
Ġm issing
b h
ĠÐ ½
Ġend point
ĠSe arch
ch at
Env ironment
C ancel
æ į
Ġ util
Ġr untime
201 3
av er
í ķ
em bed
Ġmod ified
Sh ader
ĠOn ly
d jango
PRE SS
Ġcom mit
Content s
OP EN
Ġb lack
CT OR
N R
Ġcon straint
Ġr t
ĠS imple
b eta
Ġiter ator
ly ing
× ķ
pre vious
s ent
C U
Ġp riv
Ġmatch ing
Ġf i
ref resh
process or
e ff
De lay
Pan e
=- =-
Â ·
PR INT
å ·
Ġter m
I ENT
Ġ2 6
mar sh
ĠUn it
Frame s
ĠTh read
Ġd at
ĠConfig uration
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠ
ĠDE BUG
++ ++
S yntax
è Ģ
N L
S rc
oot er
ENO MEM
channel s
Ġp in
8 000
m v
mov es
æ Ģ
t ar
red irect
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠ
(" .
mem Item
rep o
Ġth ose
w iki
" }
Ġinst alled
n c
ACT IVE
e a
unk nown
Ġl at
g ot
answ er
add Class
h ook
S IGN
ĠC L
ol ved
e ded
ĠC SS
Ġf lex
T T
Ġtra ce
Ġ201 1
) ',
w orld
U A
Ġpri mary
IB UT
B us
S lot
ĠAs sembly
Ġro ute
OUT PUT
Î ¿
n v
act ual
pc m
RE A
Ġno thing
ĠM ax
čĊĉ čĊ
Ġst ats
ĠCh ar
Ġ1 28
sw ap
if act
Ġ2 7
/> .
ct ree
view port
Imp lement
ĠF ILE
Ġf etch
ir r
ĠT EST
out er
Ġ201 6
co s
al og
é Ĺ
RE SET
ĠF ilter
Ð° ÑĤ
Ġlog ging
SE C
Ġw orld
---- -
ME SSAGE
Ġ( [
G ER
ex ecut
l x
if e
Be gin
âĶ Ģ
ate st
00 5
ĠU til
ĠD I
let te
Sc an
ĠO p
Ġallow s
get Type
ud it
In struction
H istory
//////////////////////////////// ////////////////////////////////
N ow
;| &
local host
G oogle
15 0
com ments
arg ument
Fail ure
Ġne ver
op acity
b lack
Ġy ear
Ġper iod
loy ment
Ġup per
bu cket
ale s
